package paragraphs;

public class Text {

    public final static String FOXSTORYSTARTER = "Каждое утро Лисёнок просыпался, завтракал и шёл увидеться с Бельчонком. Это утро не было исключением. " +
            "Лисёнок пришёл на их обычное место встречи, но Бельчонка там не было.  \nЛисёнок ждал, ждал, но так и не смог дождаться своего друга. " +
            "\" Бельчонок не пропустил еще ни одной встречи, вдруг он попал в беду.\" - подумал Лисёнок. Как поступить Лисенку?";

    public final static String ASKANIMALS = "Пока Лисёнок принимал решение, лесные жители разошлись кто куда. Остались только Сова и Волк. Но у Совы бывают " +
            "проблемы с памятью, а Волк может сильно разозлиться из-за расспросов. Кого выбрать?";

    public final static String ASKOWL = "Сова долго не хотела говорить, но в итоге сказала, что видела испуганного Бельчонка, бежавшего вглубь леса. Все " +
            "лесные жители знают, что в глубине леса опасно, если Бельчонок там, ему срочно нужна помощь.";

    public final static String BELIEVEOWL = "В глубине леса Лисёнок встретил Медвежонка. Ленивый Медвежонок был готов рассказать все, что знает, если Лисёнок принесёт ему мёда.";

    public final static String RETURNHOME = "Вернувшись домой, Лисёнок нашёл там Бельчонка. Оказалось, что Бельчонок пришёл на место встречи раньше и увидел " +
            "там рой злобных пчел. \nОн поспешил предупредить об этом Лисёнка, но они разминулись. Наконец-то друзья нашли друг друга! Игра завершилась успехом ✌";

    public final static String FOXGOSERCH = "Все лесные жители были заняты своими делами и не обращали внимания на Лисёнка и его проблему. Но вдруг кто нибудь " +
            "видел Бельчонка... Лисёнок не знал, что ему делать. Помогите ему.";

    public final static String FOXWAITS = "Лисёнок подождал немного, и пчёлы разлетелись. Лисёнок без проблем набрал мёда. Вдруг он понял, что очень голоден. Что же делать?";

    public final static String ASKWOLF = "Волк оказался вполне дружелюбным, но помочь не смог. Лишь сказал, что маленькому лисенку не стоит бродить по лесу одному. И как теперь поступить?";

    public final static String FOXRESTS = "Пока Лисёнок ел, злобные пчёлы вернулись и покусали его. Лисёнку нужна помощь, он не сможет продолжить поиски. Игра завершилась неудачей";

    public final static String HONEYFORBEAR = "Довольный Медвежонок рассказал Лисёнку, что очень хорошо знает семью Белок и уверен, что Бельчонок никогда не пошёл бы в глубь леса. " +
            "Он заверял Лисёнка, \nчто Белки не попадают в неприятности, и что Совам нельзя верить, он также уговаривал Лисёнка вернуться домой.";

    public final static String STEALHONEY = "Это была не лучшая идея. Пчёлы покусали Лисёнка, теперь ему самому нужна помощь. Игра завершилась неудачей";

    public final static String TRYGETHONEY = "Лисёнок быстро нашёл мёд, но вокруг летал рой злобных пчел. Лисёнок всегда боялся пчёл, но и не найти друга он тоже боялся.";

    public final static String SEARCHSQUIRREL = "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. Теперь его самого нужно искать. Игра завершилась неудачей";

}
